/*********************************************************************************************************************
 * COPYRIGHT NOTICE
 * Copyright (c) 2019,逐飞科技
 * All rights reserved.
 * 技术讨论QQ群：一群：179029047(已满)  二群：244861897
 *
 * 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
 * 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
 *
 * @file				main
 * @company			成都逐飞科技有限公司
 * @author			逐飞科技(QQ3184284598)
 * @version			查看doc内version文件 版本说明
 * @Software			IAR 8.3 or MDK 5.24
 * @Target core		MM32SPIN2XPs
 * @Taobao			https://seekfree.taobao.com/
 * @date				2020-11-23
 ********************************************************************************************************************/

#include "headfile.h"
#include "display.h"
#include "mm32_device.h"
// *************************** 例程说明 ***************************
//
// 测试需要准备逐飞科技MM32SPIIN27PS核心板一块
//
// 调试下载需要准备逐飞科技CMSIS-DAP或Jlink调试下载器一个
//
// 本例程是个空工程 用来给同学们移植使用
//
// 打开新的工程或者工程移动了位置务必执行以下操作
// 第一步 关闭上面所有打开的文件
// 第二步 project  clean  等待下方进度条走完
//
// *************************** 例程说明 ***************************

// **************************** 宏定义 ****************************
// **************************** 宏定义 ****************************

// **************************** 变量定义 ****************************

// **************************** 变量定义 ****************************
uint32_t *value;
uint32_t val;
int judge = 0;
int start = 0;
// **************************** 代码区域 ****************************
INIT_DEVICE_EXPORT(displayInit);
int main(void)
{
	//此处编写用户代码(例如：外设初始化代码等)
	// displayInit();
	//此处编写用户代码(例如：外设初始化代码等)
	RCC_HSEConfig(RCC_HSE_ON);
	value = RCC->CFGR;
	while (1)
	{
		judge = READ_BIT(RCC->CR, RCC_CR_HSERDY)>>RCC_CR_HSERDY_Pos;
		val = RCC_GetSYSCLKSource();
//		val = *value & RCC_CFGR_SW; 
//		ips114_showint32(0, 0, *value, 10);
		start = 1;
	}
}
// **************************** 代码区域 ****************************
