/*********************************************************************************************************************
* COPYRIGHT NOTICE
* Copyright (c) 2019,逐飞科技
* All rights reserved.
* 技术讨论QQ群：一群：179029047(已满)  二群：244861897
*
* 以下所有内容版权均属逐飞科技所有，未经允许不得用于商业用途，
* 欢迎各位使用并传播本程序，修改内容时必须保留逐飞科技的版权声明。
*
* @file				main
* @company			成都逐飞科技有限公司
* @author			逐飞科技(QQ3184284598)
* @version			查看doc内version文件 版本说明
* @Software			IAR 8.3 or MDK 5.24
* @Target core		MM32SPIN2XPs
* @Taobao			https://seekfree.taobao.com/
* @date				2020-11-23
********************************************************************************************************************/

#include "headfile.h"

// *************************** 例程说明 ***************************
// 
// 测试需要准备逐飞科技MM32SPIIN27PS核心板一块
// 
// 调试下载需要准备逐飞科技CMSIS-DAP或Jlink调试下载器一个
// 
// 本例程是个空工程 用来给同学们移植使用
// 
// 打开新的工程或者工程移动了位置务必执行以下操作
// 第一步 关闭上面所有打开的文件
// 第二步 project  clean  等待下方进度条走完
// 
// *************************** 例程说明 ***************************

// **************************** 宏定义 ****************************
// **************************** 宏定义 ****************************

// **************************** 变量定义 ****************************
uint16 loop_count = 0;
uint8 io_input_state = 0;

// **************************** 变量定义 ****************************

// **************************** 代码区域 ****************************
int main(void)
{
	board_init(true);																// 初始化 debug 输出串口

	//此处编写用户代码(例如：外设初始化代码等)
	pwm_init_self();
	ips114_init();
////	mt9v03x_init();	
	uart_init(UART_1,9600,UART1_TX_A09,UART1_RX_A10);
//	uart_tx_irq(WIRELESS_UART,1);
	//此处编写用户代码(例如：外设初始化代码等)

	while(1)
	{
		ips114_showint16(0, 0, 10);
//		loop_count++;
//		uart_getchar(UART_1, &io_input_state);
////		uart_query(UART_1, &io_input_state);
		uart_putchar(UART_1, 100);
//		ips114_showuint8(0, 0, io_input_state);
//		ips114_showuint8(0, 1, loop_count);
		//此处编写需要循环执行的代码
//		ips200_displayimage032(mt9v03x_image[0], MT9V03X_W, MT9V03X_H);
		//此处编写需要循环执行的代码
	}
}
// **************************** 代码区域 ****************************
